In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
# List
data = [10, 20, 30, 40]
df = pd.DataFrame(data, columns=['Numbers'])
df

   Numbers
0       10
1       20
2       30
3       40

In [3]:
data = [
    [1, 'Ryan'],
    [2, 'Bob'],
    [3, 'Charlie']
]
df = pd.DataFrame(data, columns=['ID', 'Name'])
df

   ID     Name
0   1     Ryan
1   2      Bob
2   3  Charlie

In [4]:
data = {
    'Name': ['Ryan', 'Bob', 'Charlie'],
    'Age': [27, 30, 40]
}
df = pd.DataFrame(data)
df

      Name  Age
0     Ryan   27
1      Bob   30
2  Charlie   40

In [5]:
s1 = pd.Series([25, 30], index=['a', 'b'])
s1

a    25
b    30
dtype: int64

In [6]:
s2 = pd.Series(['NY', 'LA'], index=['a', 'b'])
s2

a    NY
b    LA
dtype: object

In [8]:
data = {
    'age': s1,
    'city': s2
}
df = pd.DataFrame(data)
df

   age city
a   25   NY
b   30   LA

In [9]:
# tuples
records = [
    (1, 'Ryan'),
    (2, 'Bob'),
    (3, 'Charlie')
]
df = pd.DataFrame.from_records(records, columns=['ID', 'Name'])
df

   ID     Name
0   1     Ryan
1   2      Bob
2   3  Charlie

In [10]:
data = [
    {'Name':'Ryan', 'Age':27},
    {'Name':'Bob', 'Age':30}
]
df = pd.DataFrame(data)
df

   Name  Age
0  Ryan   27
1   Bob   30

In [11]:
teams = ['Rays', 'Yankees']
wins = [45, 40]
df = pd.DataFrame({'Team': teams, 'Wins': wins})
df

      Team  Wins
0     Rays    45
1  Yankees    40

In [12]:
s = pd.Series([10, 20, 30])
df = pd.DataFrame(s, columns=['Values'])
df

   Values
0      10
1      20
2      30

In [13]:
s1 = pd.Series([10, 20, 30])
s2 = pd.Series(['Topps', 'Panini', 'Upper Deck'])
df = pd.DataFrame({'value':s1, 'Card Company': s2})
df

   value Card Company
0     10        Topps
1     20       Panini
2     30   Upper Deck

In [ ]:
df = pd.read_csv("data.csv")

In [ ]:
df = pd.read_excel("data.xlsx")

In [ ]:
df = pd.read_json("data.json")

In [14]:
import io
json_str = '''
[
  {"Band":"Billy Strings", "Genre":"Bluegrass"},
  {"Band":"Northlane", "Genre":"Metal"}
]
'''
df = pd.read_json(io.StringIO(json_str))
df

            Band      Genre
0  Billy Strings  Bluegrass
1      Northlane      Metal

In [15]:
data = {
    'Name': ['Ryan', 'Bob', 'Charlie'],
    'Age': [27, 30, 40]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df

         Name  Age
row1     Ryan   27
row2      Bob   30
row3  Charlie   40

In [16]:
original_df = pd.DataFrame({
    'Name': ['Ryan', 'Bob', 'Charlie'],
    'Age': [27, 30, 40],
    'City': ['Orlando', 'NY', 'LA']
})
new_df = original_df[['Name', 'City']]
new_df

      Name     City
0     Ryan  Orlando
1      Bob       NY
2  Charlie       LA

In [17]:
rows = []
for i in range(3):
  rows.append({'A': i, 'B': i*10})
df = pd.DataFrame(rows)
df

   A   B
0  0   0
1  1  10
2  2  20

In [18]:
arr = np.array([[1, 2], [3, 4], [5, 6]])
df = pd.DataFrame(arr, columns = ['Col1', 'Col2'])
df

   Col1  Col2
0     1     2
1     3     4
2     5     6

In [ ]:
import sqlite3
conn = sqlite3.connect('mydatabase.db')
query = "Select * From users"
df = pd.read_sql_query(query, conn)